app/Controllers/Home.php

SELECT *
FROM `berita`
ORDER BY `berita_tanggal` DESC
 LIMIT 3
SELECT *
FROM `agenda`
ORDER BY `agenda_id` DESC
 LIMIT 3
---
    public function index()
    {
        $beritaModel = new BeritaModel();
        $agendaModel = new AgendaModel();
        $alumniModel = new AlumniModel();
        $artikelModel = new ArtikelModel();

        $data['title'] = 'KSPK UNWIRA - Home';
        $data['berita'] = $beritaModel->orderBy('berita_tanggal', 'DESC')->findAll(3);
        $data['agenda'] = $agendaModel->orderBy('agenda_id', 'DESC')->findAll(3);