app/Models/AlumniModel.php

SELECT COUNT(*) AS `numrows`
FROM `alumni`
---
    function jumlah($limit = null, $param = null)
    {
        if ($param != null) {
            $this->where($param);
            return $this->countAllResults();

SELECT `alumni_tahunlulus`, COUNT(alumni_id) as jumlah
FROM `alumni`
GROUP BY `alumni_tahunlulus`
ORDER BY `alumni_tahunlulus` DESC
 LIMIT 5
---
    function countTahun($limit = null)
    {
        $cacheKey = $this->countTahunCacheKey($limit);

        return cache()->remember($cacheKey, self::CACHE_TTL, function () use ($limit) {
            $this->select('alumni_tahunlulus, COUNT(alumni_id) as jumlah');
            $this->groupBy('alumni_tahunlulus');
            $this->orderBy('alumni_tahunlulus', 'desc');

            if ($limit != null) {
                $this->limit($limit);
            } else {
                $this->limit(5);
            }

            return $this->find();
        });